test-perf/artillery.yml
config:
  target: "{{ $processEnvironment.HOST }}"
  http:
    timeout: 240

  phases:
    - name: "POST measurement"
      duration: "{{ $processEnvironment.DURATION }}"
      arrivalRate: "{{ $processEnvironment.RPS }}"

scenarios:
  - name: "Ping 100 probes"
    flow:
      - post:
          url: "/v1/measurements?adminkey=admin"
          json:
            target: "google.com"
            type: "mtr"
            limit: "{{ $processEnvironment.LIMIT }}"
            locations: []